[
    {
        "id": 1,
        "nama_himpunan": "Himpunan Mahasiswa Sipil (HMS)",
        "logo_himpunan": "/images/sipil.png",
        "deskripsi_himpunan": "HMS merupakan organisasi mahasiswa jurusan Teknik Sipil yang berperan sebagai wadah pengembangan keilmuan, minat, bakat, serta pelayanan bagi mahasiswa Teknik Sipil UNDIP. HMS aktif dalam menyelenggarakan berbagai kegiatan seperti seminar, pelatihan, dan lomba yang berhubungan dengan konstruksi, manajemen proyek, dan infrastruktur."
    },
    {
        "id": 2,
        "nama_himpunan": "HM Arsitektur Amoghasida",
        "logo_himpunan": "/images/arsitektur.jpg",
        "deskripsi_himpunan": "HM Arsitektur Amoghasida bertujuan mendukung kreativitas dan inovasi mahasiswa dalam bidang desain arsitektur serta perencanaan ruang. Beragam kegiatan seperti pameran karya, diskusi desain, dan kompetisi diadakan untuk mendorong mahasiswa menghasilkan karya berkualitas tinggi."
    },
    {
        "id": 3,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Kimia (HMTK)",
        "logo_himpunan": "/images/kimia.jpg",
        "deskripsi_himpunan": "HMTK fokus pada pengembangan kemampuan mahasiswa Teknik Kimia melalui berbagai kegiatan akademik, pelatihan, dan perlombaan. Selain itu, himpunan ini memfasilitasi pengembangan karier, khususnya di bidang industri kimia, proses, dan teknologi lingkungan."
    },
    {
        "id": 4,
        "nama_himpunan": "Himpunan Mahasiswa Mesin (HMM)",
        "logo_himpunan": "/images/mesin.jpg",
        "deskripsi_himpunan": "HMM mendukung pengembangan keterampilan teknis dan kepemimpinan mahasiswa Teknik Mesin. Beragam program seperti workshop, kompetisi robotik, seminar teknologi, dan kegiatan lainnya secara rutin dilaksanakan untuk mendukung pengembangan keahlian teknis di bidang mekanik."
    },
    {
        "id": 5,
        "nama_himpunan": "Himpunan Mahasiswa Elektro (HME)",
        "logo_himpunan": "/images/elektro.jpg",
        "deskripsi_himpunan": "HME memfasilitasi mahasiswa Teknik Elektro dalam pengembangan keilmuan, terutama di bidang sistem kelistrikan, kontrol, dan telekomunikasi. Program yang dilaksanakan meliputi pelatihan, kompetisi teknologi, dan kolaborasi bersama pihak industri."
    },
    {
        "id": 6,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Planologi (HMTP)",
        "logo_himpunan": "/images/planologi.jpg",
        "deskripsi_himpunan": "HMTP menyediakan sarana pengembangan keilmuan dalam bidang perencanaan wilayah dan kota. Berbagai kegiatan seperti seminar, penelitian, dan pengabdian masyarakat di bidang tata ruang dirancang untuk meningkatkan pemahaman mahasiswa."
    },
    {
        "id": 7,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Komputer HIMASKOM",
        "logo_himpunan": "/images/komputer.jpg",
        "deskripsi_himpunan": "HIMASKOM berfokus pada pengembangan keahlian mahasiswa dalam teknologi informasi, pengembangan perangkat lunak, dan jaringan komputer. Pelatihan coding, hackathon, serta seminar terkait perkembangan teknologi terkini secara rutin dilaksanakan."
    },
    {
        "id": 8,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Industri",
        "logo_himpunan": "/images/industri.jpg",
        "deskripsi_himpunan": "Himpunan Mahasiswa Teknik Industri menyediakan ruang bagi pengembangan keahlian mahasiswa dalam manajemen, produksi, dan efisiensi sistem. Pelatihan perangkat lunak, seminar manajemen operasi, dan studi kasus menjadi program yang sering dilaksanakan."
    },
    {
        "id": 9,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Lingkungan (HMTL)",
        "logo_himpunan": "/images/lingkungan.jpg",
        "deskripsi_himpunan": "HMTL fokus pada isu lingkungan seperti pengelolaan limbah, konservasi air, dan pembangunan berkelanjutan. Berbagai program seperti penyuluhan lingkungan, penelitian, dan kampanye kesadaran masyarakat tentang lingkungan secara rutin diselenggarakan."
    },
    {
        "id": 10,
        "nama_himpunan": "Himpunan Mahasiswa Perkapalan (HIMASPAL)",
        "logo_himpunan": "/images/kapal.jpg",
        "deskripsi_himpunan": "HIMASPAL mendukung pengembangan kompetensi mahasiswa dalam bidang desain dan rekayasa kapal. Program unggulan meliputi pelatihan perangkat lunak desain kapal, seminar maritim, serta studi lapangan terkait industri perkapalan."
    },
    {
        "id": 11,
        "nama_himpunan": "Himpunan Mahasiswa Teknik Geodesi",
        "logo_himpunan": "/images/geodesi.jpg",
        "deskripsi_himpunan": "Himpunan Mahasiswa Teknik Geodesi mendukung pengembangan kemampuan di bidang pemetaan, survei, dan geospasial. Program yang dijalankan meliputi pelatihan teknologi pemetaan, aplikasi GIS, dan pengabdian masyarakat terkait pemetaan wilayah."
    },
    {
        "id": 12,
        "nama_himpunan": "HMTG MAGMADIPA",
        "logo_himpunan": "/images/geologi.jpg",
        "deskripsi_himpunan": "HMTG MAGMADIPA mendukung pengembangan wawasan mahasiswa Teknik Geologi dalam bidang ilmu kebumian, seperti geologi lingkungan, eksplorasi, dan mitigasi bencana. Ekskursi geologi, penelitian lapangan, serta seminar kebumian menjadi bagian dari kegiatan yang dilaksanakan."
    }
]
